m=1:19;
h=[0.01218354,-0.009012882,-0.02881839,-0.04743239,-0.04584568,-0.008692503,0.06446265,0.1544655,0.2289794,0.257883,0.2289794,0.1544655,0.06446265,-0.008692503,-0.04584568,-0.04743239,-0.02881839,-0.009012882,0.01218354];
subplot(4,2,3);stem(h);title('h的时域特性'); 
%k=-10:10;
%H=h*(exp(-j*pi/25)).^(n'*k);  %信号 x(n)进行傅里叶变换得到 H(k) 
%magH=abs(H);      %频域信号 X(k)的幅频特性 
%subplot(4,2,4);stem(k,magH);title('滤波器的频谱图');
H=fft(h,19);
Fh=H(1:10);
Fh=abs(Fh);
p=((0:9)+1)*fs/19;
subplot(4,2,4);plot(p,Fh), title('Frequency spectrum'),grid; %做出语音信号的频谱图 
xlabel('Frequency(Hz)'); ylabel('Amplitude');
