%-----------------------------------------------------------------
% exa020806, for example 2.8.6
% to test tf2zp,zp2tf,sort,and poly;
%-----------------------------------------------------------------
clear; 

B=[1 -3.3 7.25 -6.7 3 -0.8];
L=length(B);
A=zeros(1,L);
A(1)=1;   % 得到  H(z)=B(z)/A(z),A(z)=1;
%
[Z,P,K]=tf2zp(B,A)                 
% 求H(z)的极零点，即实现由有理多项式到极零点的转换;
% 
sort(Z)                            
%将零点按模的大小，以递减的方式排序；

[b,a]=zp2tf(Z,P,K)   
% 实现由极零点到有理多项式的转换; 
%
Z1=roots(B)
% 求多项式的根；
poly(Z1)
% 由多项式的根重构该多项式

